## Plan Result (prod-prod)




<pre><code>Plan: 1 to import, 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.hearings_reform_hmcts_net.azurerm_role_assignment.dnszonecontributer
* Update
  * module.hearings_reform_hmcts_net.azurerm_dns_zone.zone




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hearings_reform_hmcts_net.azurerm_dns_zone.zone will be updated in-place
  # (imported from "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/hearings.reform.hmcts.net")
  ~ resource "azurerm_dns_zone" "zone" {
        id                        = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/hearings.reform.hmcts.net"
        max_number_of_record_sets = 10000
        name                      = "hearings.reform.hmcts.net"
        name_servers              = [
            "ns1-07.azure-dns.com.",
            "ns2-07.azure-dns.net.",
            "ns3-07.azure-dns.org.",
            "ns4-07.azure-dns.info.",
        ]
        number_of_record_sets     = 192
        resource_group_name       = "reformMgmtRG"
      ~ tags                      = {
          - "application"  = "video-hearings-service" -> null
          - "businessArea" = "Cross-Cutting" -> null
        }

        soa_record {
            email         = "azuredns-hostmaster.microsoft.com"
            expire_time   = 2419200
            fqdn          = "hearings.reform.hmcts.net."
            host_name     = "ns1-06.azure-dns.com."
            minimum_ttl   = 300
            refresh_time  = 3600
            retry_time    = 300
            serial_number = 1
            tags          = {}
            ttl           = 3600
        }
    }

  # module.hearings_reform_hmcts_net.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/hearings.reform.hmcts.net"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to import, 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1251,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->